DrugBAN3D(
  (hetero_gnn): HeteroGNN(
    (node_embeddings): ModuleDict(
      (ligand): Linear(in_features=35, out_features=320, bias=True)
      (pocket): Linear(in_features=35, out_features=320, bias=True)
    )
    (layers): ModuleList(
      (0): HeteroGraphConv(
        (mods): ModuleDict(
          (intra_l): CIGConv(
            (linear_src): Linear(in_features=320, out_features=320, bias=True)
            (linear_dst): Linear(in_features=320, out_features=320, bias=True)
            (linear_edge): Linear(in_features=17, out_features=320, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=17, bias=True)
            )
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(320, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (dropout): Dropout(p=0.1, inplace=False)
          )
          (intra_p): CIGConv(
            (linear_src): Linear(in_features=320, out_features=320, bias=True)
            (linear_dst): Linear(in_features=320, out_features=320, bias=True)
            (linear_edge): Linear(in_features=17, out_features=320, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=17, bias=True)
            )
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(320, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (dropout): Dropout(p=0.1, inplace=False)
          )
          (inter_l2p): NIGConv(
            (linear_src): Linear(in_features=320, out_features=320, bias=True)
            (linear_dst): Linear(in_features=320, out_features=320, bias=True)
            (linear_edge): Linear(in_features=11, out_features=320, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=11, bias=True)
            )
            (attn_l): Linear(in_features=960, out_features=1, bias=True)
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(320, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (feat_drop): Dropout(p=0.1, inplace=False)
          )
          (inter_p2l): NIGConv(
            (linear_src): Linear(in_features=320, out_features=320, bias=True)
            (linear_dst): Linear(in_features=320, out_features=320, bias=True)
            (linear_edge): Linear(in_features=11, out_features=320, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=11, bias=True)
            )
            (attn_l): Linear(in_features=960, out_features=1, bias=True)
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(320, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (feat_drop): Dropout(p=0.1, inplace=False)
          )
        )
      )
      (1): HeteroGraphConv(
        (mods): ModuleDict(
          (intra_l): CIGConv(
            (linear_src): Linear(in_features=320, out_features=320, bias=True)
            (linear_dst): Linear(in_features=320, out_features=320, bias=True)
            (linear_edge): Linear(in_features=17, out_features=320, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=17, bias=True)
            )
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(320, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (dropout): Dropout(p=0.1, inplace=False)
          )
          (intra_p): CIGConv(
            (linear_src): Linear(in_features=320, out_features=320, bias=True)
            (linear_dst): Linear(in_features=320, out_features=320, bias=True)
            (linear_edge): Linear(in_features=17, out_features=320, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=17, bias=True)
            )
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(320, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (dropout): Dropout(p=0.1, inplace=False)
          )
          (inter_l2p): NIGConv(
            (linear_src): Linear(in_features=320, out_features=320, bias=True)
            (linear_dst): Linear(in_features=320, out_features=320, bias=True)
            (linear_edge): Linear(in_features=11, out_features=320, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=11, bias=True)
            )
            (attn_l): Linear(in_features=960, out_features=1, bias=True)
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(320, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (feat_drop): Dropout(p=0.1, inplace=False)
          )
          (inter_p2l): NIGConv(
            (linear_src): Linear(in_features=320, out_features=320, bias=True)
            (linear_dst): Linear(in_features=320, out_features=320, bias=True)
            (linear_edge): Linear(in_features=11, out_features=320, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=11, bias=True)
            )
            (attn_l): Linear(in_features=960, out_features=1, bias=True)
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(320, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (feat_drop): Dropout(p=0.1, inplace=False)
          )
        )
      )
      (2): HeteroGraphConv(
        (mods): ModuleDict(
          (intra_l): CIGConv(
            (linear_src): Linear(in_features=320, out_features=320, bias=True)
            (linear_dst): Linear(in_features=320, out_features=320, bias=True)
            (linear_edge): Linear(in_features=17, out_features=320, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=17, bias=True)
            )
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(320, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (dropout): Dropout(p=0.1, inplace=False)
          )
          (intra_p): CIGConv(
            (linear_src): Linear(in_features=320, out_features=320, bias=True)
            (linear_dst): Linear(in_features=320, out_features=320, bias=True)
            (linear_edge): Linear(in_features=17, out_features=320, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=17, bias=True)
            )
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(320, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (dropout): Dropout(p=0.1, inplace=False)
          )
          (inter_l2p): NIGConv(
            (linear_src): Linear(in_features=320, out_features=320, bias=True)
            (linear_dst): Linear(in_features=320, out_features=320, bias=True)
            (linear_edge): Linear(in_features=11, out_features=320, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=11, bias=True)
            )
            (attn_l): Linear(in_features=960, out_features=1, bias=True)
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(320, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (feat_drop): Dropout(p=0.1, inplace=False)
          )
          (inter_p2l): NIGConv(
            (linear_src): Linear(in_features=320, out_features=320, bias=True)
            (linear_dst): Linear(in_features=320, out_features=320, bias=True)
            (linear_edge): Linear(in_features=11, out_features=320, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=11, bias=True)
            )
            (attn_l): Linear(in_features=960, out_features=1, bias=True)
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(320, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (feat_drop): Dropout(p=0.1, inplace=False)
          )
        )
      )
    )
    (output_projections): ModuleDict(
      (ligand): Linear(in_features=320, out_features=320, bias=True)
      (pocket): Linear(in_features=320, out_features=320, bias=True)
    )
    (layer_norms): ModuleDict(
      (ligand): LayerNorm((320,), eps=1e-05, elementwise_affine=True)
      (pocket): LayerNorm((320,), eps=1e-05, elementwise_affine=True)
    )
    (dropout_layer): Dropout(p=0.1, inplace=False)
  )
  (atom_atom_affinity): AtomAtomAffinities(
    (prj_l2p_src): Linear(in_features=320, out_features=320, bias=True)
    (prj_l2p_dst): Linear(in_features=320, out_features=320, bias=True)
    (prj_l2p_edge): Linear(in_features=11, out_features=320, bias=True)
    (prj_p2l_src): Linear(in_features=320, out_features=320, bias=True)
    (prj_p2l_dst): Linear(in_features=320, out_features=320, bias=True)
    (prj_p2l_edge): Linear(in_features=11, out_features=320, bias=True)
    (fc_l2p): Linear(in_features=320, out_features=1, bias=True)
    (fc_p2l): Linear(in_features=320, out_features=1, bias=True)
  )
  (bcn): BANLayer(
    (v_net): FCNet(
      (main): Sequential(
        (0): Dropout(p=0.2, inplace=False)
        (1): Linear(in_features=320, out_features=960, bias=True)
        (2): ReLU()
      )
    )
    (q_net): FCNet(
      (main): Sequential(
        (0): Dropout(p=0.2, inplace=False)
        (1): Linear(in_features=320, out_features=960, bias=True)
        (2): ReLU()
      )
    )
    (p_net): AvgPool1d(kernel_size=(3,), stride=(3,), padding=(0,))
    (bn): BatchNorm1d(320, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  )
  (mlp_classifier): MLPDecoder(
    (fc1): Linear(in_features=320, out_features=512, bias=True)
    (bn1): BatchNorm1d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (dropout1): Dropout(p=0.4, inplace=False)
    (fc2): Linear(in_features=512, out_features=512, bias=True)
    (bn2): BatchNorm1d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (dropout2): Dropout(p=0.4, inplace=False)
    (fc3): Linear(in_features=512, out_features=128, bias=True)
    (bn3): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (dropout3): Dropout(p=0.4, inplace=False)
    (fc4): Linear(in_features=128, out_features=1, bias=True)
    (proj1): Linear(in_features=320, out_features=512, bias=True)
    (proj2): Linear(in_features=512, out_features=128, bias=True)
  )
)