DrugBAN3D(
  (hetero_gnn): HeteroGNN(
    (node_projs): ModuleDict(
      (ligand): Linear(in_features=35, out_features=384, bias=True)
      (pocket): Linear(in_features=35, out_features=384, bias=True)
    )
    (layers): ModuleList(
      (0): HeteroGraphConv(
        (mods): ModuleDict(
          (intra_l): CIGConv(
            (linear_src): Linear(in_features=384, out_features=384, bias=True)
            (linear_dst): Linear(in_features=384, out_features=384, bias=True)
            (linear_edge): Linear(in_features=17, out_features=384, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=17, bias=True)
            )
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (dropout): Dropout(p=0.2, inplace=False)
          )
          (intra_p): CIGConv(
            (linear_src): Linear(in_features=384, out_features=384, bias=True)
            (linear_dst): Linear(in_features=384, out_features=384, bias=True)
            (linear_edge): Linear(in_features=17, out_features=384, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=17, bias=True)
            )
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (dropout): Dropout(p=0.2, inplace=False)
          )
          (inter_l2p): NIGConv(
            (linear_src): Linear(in_features=384, out_features=384, bias=True)
            (linear_dst): Linear(in_features=384, out_features=384, bias=True)
            (linear_edge): Linear(in_features=11, out_features=384, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=11, bias=True)
            )
            (attn_l): Linear(in_features=1152, out_features=1, bias=True)
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (feat_drop): Dropout(p=0.2, inplace=False)
          )
          (inter_p2l): NIGConv(
            (linear_src): Linear(in_features=384, out_features=384, bias=True)
            (linear_dst): Linear(in_features=384, out_features=384, bias=True)
            (linear_edge): Linear(in_features=11, out_features=384, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=11, bias=True)
            )
            (attn_l): Linear(in_features=1152, out_features=1, bias=True)
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (feat_drop): Dropout(p=0.2, inplace=False)
          )
        )
      )
      (1): HeteroGraphConv(
        (mods): ModuleDict(
          (intra_l): CIGConv(
            (linear_src): Linear(in_features=384, out_features=384, bias=True)
            (linear_dst): Linear(in_features=384, out_features=384, bias=True)
            (linear_edge): Linear(in_features=17, out_features=384, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=17, bias=True)
            )
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (dropout): Dropout(p=0.2, inplace=False)
          )
          (intra_p): CIGConv(
            (linear_src): Linear(in_features=384, out_features=384, bias=True)
            (linear_dst): Linear(in_features=384, out_features=384, bias=True)
            (linear_edge): Linear(in_features=17, out_features=384, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=17, bias=True)
            )
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (dropout): Dropout(p=0.2, inplace=False)
          )
          (inter_l2p): NIGConv(
            (linear_src): Linear(in_features=384, out_features=384, bias=True)
            (linear_dst): Linear(in_features=384, out_features=384, bias=True)
            (linear_edge): Linear(in_features=11, out_features=384, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=11, bias=True)
            )
            (attn_l): Linear(in_features=1152, out_features=1, bias=True)
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (feat_drop): Dropout(p=0.2, inplace=False)
          )
          (inter_p2l): NIGConv(
            (linear_src): Linear(in_features=384, out_features=384, bias=True)
            (linear_dst): Linear(in_features=384, out_features=384, bias=True)
            (linear_edge): Linear(in_features=11, out_features=384, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=11, bias=True)
            )
            (attn_l): Linear(in_features=1152, out_features=1, bias=True)
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (feat_drop): Dropout(p=0.2, inplace=False)
          )
        )
      )
      (2): HeteroGraphConv(
        (mods): ModuleDict(
          (intra_l): CIGConv(
            (linear_src): Linear(in_features=384, out_features=384, bias=True)
            (linear_dst): Linear(in_features=384, out_features=384, bias=True)
            (linear_edge): Linear(in_features=17, out_features=384, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=17, bias=True)
            )
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (dropout): Dropout(p=0.2, inplace=False)
          )
          (intra_p): CIGConv(
            (linear_src): Linear(in_features=384, out_features=384, bias=True)
            (linear_dst): Linear(in_features=384, out_features=384, bias=True)
            (linear_edge): Linear(in_features=17, out_features=384, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=17, bias=True)
            )
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (dropout): Dropout(p=0.2, inplace=False)
          )
          (inter_l2p): NIGConv(
            (linear_src): Linear(in_features=384, out_features=384, bias=True)
            (linear_dst): Linear(in_features=384, out_features=384, bias=True)
            (linear_edge): Linear(in_features=11, out_features=384, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=11, bias=True)
            )
            (attn_l): Linear(in_features=1152, out_features=1, bias=True)
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (feat_drop): Dropout(p=0.2, inplace=False)
          )
          (inter_p2l): NIGConv(
            (linear_src): Linear(in_features=384, out_features=384, bias=True)
            (linear_dst): Linear(in_features=384, out_features=384, bias=True)
            (linear_edge): Linear(in_features=11, out_features=384, bias=True)
            (edge_adapter): Sequential(
              (0): Linear(in_features=256, out_features=64, bias=True)
              (1): ReLU()
              (2): Linear(in_features=64, out_features=11, bias=True)
            )
            (attn_l): Linear(in_features=1152, out_features=1, bias=True)
            (activation): PReLU(num_parameters=1)
            (bn): BatchNorm1d(384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (feat_drop): Dropout(p=0.2, inplace=False)
          )
        )
      )
    )
    (layer_norms): ModuleDict(
      (ligand): LayerNorm((384,), eps=1e-05, elementwise_affine=True)
      (pocket): LayerNorm((384,), eps=1e-05, elementwise_affine=True)
    )
    (batch_norms): ModuleDict(
      (ligand): BatchNorm1d(384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (pocket): BatchNorm1d(384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    )
    (dropouts): ModuleDict(
      (ligand): Dropout(p=0.2, inplace=False)
      (pocket): Dropout(p=0.2, inplace=False)
    )
    (activation): PReLU(num_parameters=1)
  )
  (atom_atom_affinity): AtomAtomAffinities(
    (prj_l2p_src): Linear(in_features=384, out_features=384, bias=True)
    (prj_l2p_dst): Linear(in_features=384, out_features=384, bias=True)
    (prj_l2p_edge): Linear(in_features=11, out_features=384, bias=True)
    (prj_p2l_src): Linear(in_features=384, out_features=384, bias=True)
    (prj_p2l_dst): Linear(in_features=384, out_features=384, bias=True)
    (prj_p2l_edge): Linear(in_features=11, out_features=384, bias=True)
    (fc_l2p): Linear(in_features=384, out_features=1, bias=True)
    (fc_p2l): Linear(in_features=384, out_features=1, bias=True)
  )
  (bias_ligandpocket): BiasCorrectionLigandPocket(
    (prj_src): Linear(in_features=384, out_features=384, bias=True)
    (prj_dst): Linear(in_features=384, out_features=384, bias=True)
    (prj_edge): Linear(in_features=11, out_features=384, bias=True)
    (w_src): Linear(in_features=384, out_features=384, bias=True)
    (w_dst): Linear(in_features=384, out_features=384, bias=True)
    (w_edge): Linear(in_features=11, out_features=384, bias=True)
    (lin_att): Sequential(
      (0): PReLU(num_parameters=1)
      (1): Linear(in_features=384, out_features=1, bias=True)
    )
    (fc): Sequential(
      (0): Linear(in_features=384, out_features=192, bias=True)
      (1): Dropout(p=0.1, inplace=False)
      (2): PReLU(num_parameters=1)
      (3): BatchNorm1d(192, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (4): Linear(in_features=192, out_features=1, bias=True)
    )
  )
  (bias_pocketligand): BiasCorrectionPocketLigand(
    (prj_src): Linear(in_features=384, out_features=384, bias=True)
    (prj_dst): Linear(in_features=384, out_features=384, bias=True)
    (prj_edge): Linear(in_features=11, out_features=384, bias=True)
    (w_src): Linear(in_features=384, out_features=384, bias=True)
    (w_dst): Linear(in_features=384, out_features=384, bias=True)
    (w_edge): Linear(in_features=11, out_features=384, bias=True)
    (lin_att): Sequential(
      (0): PReLU(num_parameters=1)
      (1): Linear(in_features=384, out_features=1, bias=True)
    )
    (fc): Sequential(
      (0): Linear(in_features=384, out_features=192, bias=True)
      (1): Dropout(p=0.1, inplace=False)
      (2): PReLU(num_parameters=1)
      (3): BatchNorm1d(192, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (4): Linear(in_features=192, out_features=1, bias=True)
    )
  )
  (bcn): BANLayer(
    (v_net): FCNet(
      (main): Sequential(
        (0): Dropout(p=0.2, inplace=False)
        (1): Linear(in_features=384, out_features=1152, bias=True)
        (2): ReLU()
      )
    )
    (q_net): FCNet(
      (main): Sequential(
        (0): Dropout(p=0.2, inplace=False)
        (1): Linear(in_features=384, out_features=1152, bias=True)
        (2): ReLU()
      )
    )
    (p_net): AvgPool1d(kernel_size=(3,), stride=(3,), padding=(0,))
    (bn): BatchNorm1d(384, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  )
  (mlp_classifier): MLPDecoder(
    (fc1): Linear(in_features=386, out_features=512, bias=True)
    (bn1): BatchNorm1d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (dropout1): Dropout(p=0.7, inplace=False)
    (fc2): Linear(in_features=512, out_features=512, bias=True)
    (bn2): BatchNorm1d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (dropout2): Dropout(p=0.7, inplace=False)
    (fc3): Linear(in_features=512, out_features=128, bias=True)
    (bn3): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (dropout3): Dropout(p=0.7, inplace=False)
    (fc4): Linear(in_features=128, out_features=1, bias=True)
    (proj1): Linear(in_features=386, out_features=512, bias=True)
    (proj2): Linear(in_features=512, out_features=128, bias=True)
  )
)